---
kind: method
id: M:Autodesk.Revit.DB.FilterStringRule.SetEvaluator(Autodesk.Revit.DB.FilterStringRuleEvaluator)
source: html/34bbfdd6-2d7a-1459-b01f-1334df763d8f.htm
---
# Autodesk.Revit.DB.FilterStringRule.SetEvaluator Method

Sets the evaluator that implements the test for this rule.

## Syntax (C#)
```csharp
public void SetEvaluator(
	FilterStringRuleEvaluator evaluator
)
```

## Parameters
- **evaluator** (`Autodesk.Revit.DB.FilterStringRuleEvaluator`)

## Exceptions
- **Autodesk.Revit.Exceptions.ArgumentNullException** - A non-optional argument was null